base/InformationRegisters/бит_НазначенныеЗаместители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НазначенныеЗаместители</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПередаватьПраваРЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СостоянияЗаместителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Виза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыВиз</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПользовательскоеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заместитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыФормОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыФормОбъекта</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Элемента</Name>
					<Comment>Форма элемента</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списка</Name>
					<Comment>Форма списка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбора</Name>
					<Comment>Форма выбора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документа</Name>
					<Comment>Форма документа</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_СостоянияЗаместителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СостоянияЗаместителей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеЗавершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/ГруппыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Только для персональных групп доступа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяГруппаДоступаПоставляемогоПрофиля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсеРазрешены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяНижестоящие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/CommonModules/бит_ПраваДоступа/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область Подписки

// Процедура обработчик подписки "бит_ПередЗаписьюСправочникаПраваДоступа" на событие  "ПередЗаписью" 
//
// Параметры:
// Источник - СправочникОбъект
// Отказ - Булево
//
Процедура бит_ПередЗаписьюСправочникаПраваДоступаПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
	    // функционал БФ может работать только в узлах, созданных с помощью ПО бит_Полный		
		Возврат;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьРазделениеДоступаНаУровнеБазы") Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Если (Метаданные.Справочники.Найти("Пользователи") <> Неопределено И ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи"))
			ИЛИ (Метаданные.Справочники.Найти("ИдентификаторыОбъектовМетаданных") <> Неопределено И ТипЗнч(Источник) = Тип("СправочникОбъект.ИдентификаторыОбъектовМетаданных")) Тогда		
			Возврат;                                                                                                                                                                  		
		КонецЕсли; 				
		
		События = ПроверитьПраваДоступа(Источник, Пользователи.ТекущийПользователь());
		ОповеститьОбОтсутствииДоступа(Источник,События,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик подписки "бит_ПриКопированииСправочникаПраваДоступа" на событие  "ПриКопировании".
// 
// Параметры:
//  Источник          - СправочникОбъект.
//  ОбъектКопирование - СправочникОбъект.
// 
Процедура бит_ПриКопированииСправочникаПраваДоступаПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
	    // Функционал БФ может работать только в узлах, созданных с помощью ПО бит_Полный.
		Возврат;
	КонецЕсли; 		
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьРазделениеДоступаНаУровнеБазы") Тогда
		Возврат;	
	КонецЕсли; 

	Отказ = Ложь;
	ТекущиеСобытия = Новый Структура;
	ТекущиеСобытия.Вставить("Редактирование",Ложь);
	ТекущиеСобытия.Вставить("Создание",Ложь);		
	ТекущиеСобытия.Вставить("Копирование",Ложь);	
	
	События = ПроверитьПраваДоступа(Источник, Пользователи.ТекущийПользователь(),,ТекущиеСобытия);
	ОповеститьОбОтсутствииДоступа(Источник,События,Отказ);			
	
	Если Отказ Тогда
		Источник.ДополнительныеСвойства.Вставить("Отказ",Истина);
	КонецЕсли;
	
КонецПроцедуры // бит_ПриКопированииСправочникаПраваДоступаПриКопировании()

// Процедура обработчик подписки "бит_ПередЗаписьюДокументаПраваДоступа" на событие  "ПередЗаписью".
// 
// Параметры:
//  Источник        - ДокументОбъект.
//  Отказ           - Булево.
//  РежимЗаписи     - РежимЗаписиДокумента.
//  РежимПроведения - РежимПроведенияДокумента.
// 
Процедура бит_ПередЗаписьюДокументаПраваДоступаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
	    // Функционал БФ может работать только в узлах, созданных с помощью ПО бит_Полный.
		Возврат;
	КонецЕсли; 			
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьРазделениеДоступаНаУровнеБазы") Тогда
		Возврат;	
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		События = ПроверитьПраваДоступа(Источник, Пользователи.ТекущийПользователь(),РежимЗаписи);
		ОповеститьОбОтсутствииДоступа(Источник,События,Отказ);
	КонецЕсли; 
	
КонецПроцедуры // бит_ПередЗаписьюДокументаПраваДоступаПередЗаписью()

// Процедура обработчик подписки "бит_ПриКопированииСправочникаПраваДоступа" на событие  "ПриКопировании".
// 
// Параметры:
//  Источник          - ДокументОбъект.
//  ОбъектКопирование - ДокументОбъект.
// 
Процедура бит_ПриКопированииДокументаПраваДоступаПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
	    // Функционал БФ может работать только в узлах, созданных с помощью ПО бит_Полный.
		Возврат;
	КонецЕсли; 			
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьРазделениеДоступаНаУровнеБазы") Тогда
		Возврат;	
	КонецЕсли; 
	
	Отказ = Ложь;
	ТекущиеСобытия = Новый Структура;
	ТекущиеСобытия.Вставить("Редактирование",Ложь);
	ТекущиеСобытия.Вставить("Создание",Ложь);		
	ТекущиеСобытия.Вставить("Копирование",Ложь);	
	
	События = ПроверитьПраваДоступа(Источник, Пользователи.ТекущийПользователь(),,ТекущиеСобытия);
	ОповеститьОбОтсутствииДоступа(Источник,События,Отказ);			
	
	Если Отказ Тогда
		Источник.ДополнительныеСвойства.Вставить("Отказ",Истина);
	КонецЕсли; 
	
КонецПроцедуры // бит_ПриКопированииДокументаПраваДоступаПриКопировании()

// Процедура обработчик подписки "бит_ПередЗаписьюРегистраСведенийПраваДоступа" на событие  "ПередЗаписью" 
//
// Параметры:
// Источник - РегистрСведенийНаборЗаписей
// Отказ    - Булево
// Замещение- Булево
//
Процедура бит_ПередЗаписьюРегистраСведенийПраваДоступаПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
		
	    // функционал БФ может работать только в узлах, созданных с помощью ПО бит_Полный		
		Возврат;
	
	КонецЕсли; 			
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьРазделениеДоступаНаУровнеБазы") Тогда
		Возврат;	
	КонецЕсли;
	
	МетаданныеРегистра = Источник.Метаданные();
	
	Если МетаданныеРегистра.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
		Возврат;
	КонецЕсли; 
	
	Если (Метаданные.РегистрыСведений.Найти("РезультатыОбменаДанными") <> Неопределено И ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РезультатыОбменаДанными"))
		ИЛИ (Метаданные.РегистрыСведений.Найти("ПраваРолей") <> Неопределено И ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ПраваРолей"))
		ИЛИ (Метаданные.РегистрыСведений.Найти("ЗависимостиПравДоступа") <> Неопределено И ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ЗависимостиПравДоступа")) Тогда		
		Возврат;  		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		События = ПроверитьПраваДоступа(Источник, Пользователи.ТекущийПользователь());
		ОповеститьОбОтсутствииДоступа(Источник,События,Отказ);
	КонецЕсли; 
	
КонецПроцедуры
 
#КонецОбласти

#Область ПраваДоступа

// Определяет, достаточно ли у пользователя прав для обновления ИБ.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПроверитьПраваДляОбновления() Экспорт
		
	// Проверка наличия прав для обновления информационной базы.
	флЕстьПрава = Истина;
    
    Если НЕ ПравоДоступа("МонопольныйРежим" , Метаданные) 
		ИЛИ НЕ ПравоДоступа("Изменение"        , Метаданные.Константы.бит_ИспользоватьРазделениеДоступаНаУровнеБазы) 			 
		ИЛИ НЕ ПравоДоступа("Изменение"        , Метаданные.Справочники.бит_ОбъектыСистемы)
		ИЛИ НЕ ПравоДоступа("Администрирование", Метаданные) Тогда
		
		флЕстьПрава = Ложь;
		
	КонецЕсли;
	
	Возврат флЕстьПрава;
	
КонецФункции // ПроверитьПраваДляОбновления()

// Фукнция определяет доступность определенного права по отношению к выбранному
// объекту метаданных.
//
// Параметры:
//  Право      - Строка.
//  ИмяОбъекта - Строка.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьПравоДоступа(Право, ИмяОбъекта) Экспорт

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяОбъекта);
	
	Результат = ПравоДоступа(Право, ОбъектМетаданных);
		
    Возврат Результат;	

КонецФункции // ЕстьПравоДоступа() 

// Функция проверяет наличие механизма разделения прав доступа на уровне базы.
// 
// Параметры:
//  ВыводитьСообщения - Булево (По умолчанию = Ложь).
//
// Возвращаемое значение:
//  Булево.
// 
Функция ЕстьМеханизмПравДоступа(ВыводитьСообщения = Ложь) Экспорт

	ЕстьМеханизм = Истина;
    Если Метаданные.ОбщиеМодули.Найти("бит_ПраваДоступаОсновной") = Неопределено Тогда
        ЕстьМеханизм = Ложь;
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru='В данной версии отсутствует функционал разделения прав доступа на уровне базы.'; 
								  |en='In this version, there is no functionality for sharing access rights at the database level.'"); 
            ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
        КонецЕсли;
    КонецЕсли; 	

    Возврат ЕстьМеханизм;
 
КонецФункции // ЕстьМеханизмПравДоступа()

// Формирует массив с именами объектов, на которые не распространяется механизм разделение прав доступа
// на уровне базы.
// 
Функция СформироватьМассивИменИсключений() Экспорт

    МассивИсключений = Новый Массив;

    // Объекты, используемые в механизме разделения прав доступа - 
    // право определяется наличием роли бит_АдминистраторПравДоступа.
    МассивИсключений.Добавить("бит_ОбъектыСистемы");
    МассивИсключений.Добавить("бит_ОбластиДоступа");
    МассивИсключений.Добавить("бит_ШаблоныПравДоступа");
    МассивИсключений.Добавить("бит_ПраваДоступа");
    МассивИсключений.Добавить("бит_НастройкаПравДоступа");

    // Объекты используемые в механизме МХО.
    МассивИсключений.Добавить("бит_ЗначенияРеквизитовПроводок");
    МассивИсключений.Добавить("бит_НазначениеРеквизитовПроводок");
    МассивИсключений.Добавить("бит_ДанныеОтладкиПроведения");
    МассивИсключений.Добавить("бит_ИспользованиеПроводокДляДокументов");

    // Используется в механизме хранения истории редактирования справочников.
    МассивИсключений.Добавить("бит_ИсторияРедактированияРеквизитов");

    // Настройки пользователей.
    МассивИсключений.Добавить("НастройкиПользователей");
    МассивИсключений.Добавить("КонтактнаяИнформация");
    МассивИсключений.Добавить("КонтактныеЛица");
	
	// Лицензирование и УК.
	МассивИсключений.Добавить("бит_сл_СерверныеСеансы");
	
    Возврат МассивИсключений;

КонецФункции // БитСформироватьМассивИменИсключений()

// Процедура проверяет наличие прав доступа у данного пользователя на определенные действия над данным объектом
// перечень событий может быть передан в процедуру в виде структуры, либо может определяться автоматически, 
// в зависимости от вида и состояния объекта.
// 
// Параметры:
//  ТекущийОбъект       - СправочникОбъект,ДокументОбъект.
//  ТекущийПользователь - СправочникСсылка.Пользователи.
//  РежимЗаписи         - РежимЗаписиДокумента.
//  ТекущиеСобытия      - Структура - ключ: строка- имя события, значение: булево - доступность события.
//  ДопПараметры        - Структура - Задел на будущее.
// 
Функция ПроверитьПраваДоступа(ТекущийОбъект
								 , ТекущийПользователь
								 , РежимЗаписи = Неопределено
								 , ТекущиеСобытия = Неопределено
								 , ДопПараметры = Неопределено) Экспорт
								 
	Если НЕ ЕстьМеханизмПравДоступа() Тогда	
    	Возврат Новый Структура;	
	КонецЕсли; 							 
	
	События = Новый Структура;
	
	События = бит_ПраваДоступаОсновной.ПроверитьПраваДоступа(ТекущийОбъект
                                                            , ТекущийПользователь
                                                            , РежимЗаписи
                                                            , ТекущиеСобытия,ДопПараметры);
	
	Возврат События;
	
КонецФункции // ПроверитьПраваДоступа()	
  
// Функция определяет вид объекта по метаданным объекта.
// 
// Параметры:
//  МетаданныеОбъекта - ОбъектМетаданных.
// 
// Возвращаемое значение:
//   ПеречислениеСсылка.бит_ВидыОбъектовСистемы.
// 
Функция ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта) Экспорт

    ВидОбъекта = бит_УправлениеОбъектамиСистемы.ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);

    Возврат ВидОбъекта;

КонецФункции
 
// Функция получает полное имя объекта.
// 
// Параметры:
//  ИмяОбъекта - Строка - Краткое имя объекта.
//  ВидОбъекта - ПеречислениеСсылка.бит_ВидыОбъектовСистемы.
// 
// Возвращаемое значение:
//   Строка.
// 
Функция ПолучитьПолноеИмяОбъекта(ИмяОбъекта,ВидОбъекта) Экспорт
    
   	РезСтрока = бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(Перечисления.бит_ВидыОбъектовСистемы, ВидОбъекта) + "." + ИмяОбъекта;	
    Возврат РезСтрока;
    
КонецФункции // ПолучитьПолноеИмяОбъекта()

// Функция получает имя типа объекта.
// 
// Параметры:
//  ИмяОбъекта - Строка - Краткое имя объекта.
//  ВидОбъекта - ПеречислениеСсылка.бит_ВидыОбъектовСистемы.
// 
// Возвращаемое значение:
//   Строка.
// 
Функция ПолучитьИмяТипаОбъекта(ИмяОбъекта, ВидОбъекта) Экспорт
	
	РезСтрока = бит_УправлениеОбъектамиСистемы.ПолучитьИмяТипаОбъекта(ИмяОбъекта, ВидОбъекта);
	
	Возврат РезСтрока;
    
КонецФункции // БитПолучитьПолноеИмяОбъекта()

// Получает объект доступа по метаданным объекта.
// 
// Параметры:
//  МетаданныеОбъекта - ОбъектМетаданных.
// 
// Возвращаемое значение:
//   СправочникСсылка.бит_ОбъектыСистемы.
// 
Функция ПолучитьОбъектДоступаПоМетаданным(МетаданныеОбъекта) Экспорт

    ИмяОбъекта       = МетаданныеОбъекта.Имя;
    ВидОбъекта       = ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);	
    ИмяОбъектаПолное = ПолучитьПолноеИмяОбъекта(ИмяОбъекта,ВидОбъекта);

    РезОбъект = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(ИмяОбъектаПолное);

    Возврат РезОбъект;

КонецФункции // ПолучитьОбъектДоступаПоМетаданным()

// Формирует таблицу реквизитов по переданному объекту.
// 
// Параметры:
//  ТекущийОбъект     - ДокументОбъект, СправочникОбъект.
//  МетаданныеОбъекта - ОбъектМетаданных.
// 
// Возвращаемое значение:
//   ТаблицаЗначений.
// 
Функция СформироватьТаблицуРеквизитовОбъекта(ТекущийОбъект, МетаданныеОбъекта) Экспорт

	ВидОбъекта = ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);
	ИмяТипаОбъекта = ПолучитьИмяТипаОбъекта(МетаданныеОбъекта.Имя, ВидОбъекта);
	
	ТабРеквизитов = Новый ТаблицаЗначений;
	
	ОписаниеСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеЧисло  = Новый ОписаниеТипов("Число");	
	ОписаниеТипаОбъекта = Новый ОписаниеТипов(ИмяТипаОбъекта);	
	
	// Создадим колонки
	// специфические свойства для справочника и документа.
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Справочник Тогда
		Если МетаданныеОбъекта.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Строка Тогда
			ТабРеквизитов.Колонки.Добавить("Код", ОписаниеСтрока);
		ИначеЕсли МетаданныеОбъекта.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Число Тогда
			ТабРеквизитов.Колонки.Добавить("Код", ОписаниеЧисло);			
		КонецЕсли; 
		ТабРеквизитов.Колонки.Добавить("Наименование", ОписаниеСтрока);
		Если МетаданныеОбъекта.Иерархический Тогда
		    ТабРеквизитов.Колонки.Добавить("Родитель", ОписаниеТипаОбъекта);
		КонецЕсли; 
		Если МетаданныеОбъекта.Владельцы.Количество() > 0 Тогда
			ТабРеквизитов.Колонки.Добавить("Владелец");
		КонецЕсли;	
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Документ Тогда	
		Если МетаданныеОбъекта.ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераДокумента.Строка Тогда
			ТабРеквизитов.Колонки.Добавить("Номер", ОписаниеСтрока);
		ИначеЕсли МетаданныеОбъекта.ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераДокумента.Число Тогда	
			ТабРеквизитов.Колонки.Добавить("Номер", ОписаниеЧисло);
		КонецЕсли; 
		ТабРеквизитов.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	КонецЕсли; 
	ТабРеквизитов.Колонки.Добавить("Ссылка", ОписаниеТипаОбъекта);
	
	// Реквизиты объектов.
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		ТабРеквизитов.Колонки.Добавить(Реквизит.Имя, Новый ОписаниеТипов(Реквизит.Тип.Типы()));
	КонецЦикла;
	
	// Заполним значения.
	НоваяСтрока = ТабРеквизитов.Добавить();
	Для каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		НоваяСтрока[Реквизит.Имя] = ТекущийОбъект[Реквизит.имя];
	КонецЦикла;
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Справочник Тогда
		 НоваяСтрока.Код          = ТекущийОбъект.Код;
		 НоваяСтрока.Наименование = ТекущийОбъект.Наименование;
		 Если МетаданныеОбъекта.Иерархический Тогда
		    НоваяСтрока.Родитель  = ТекущийОбъект.Родитель;
		КонецЕсли; 
		Если МетаданныеОбъекта.Владельцы.Количество() > 0 Тогда
			НоваяСтрока.Владелец  = ТекущийОбъект.Владелец;
		КонецЕсли;			
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Документ Тогда	
		 НоваяСтрока.Номер = ТекущийОбъект.Номер;
		 НоваяСтрока.Дата  = ТекущийОбъект.Дата;
	КонецЕсли; 
	НоваяСтрока.Ссылка = ТекущийОбъект.Ссылка;
	
	Возврат ТабРеквизитов;
	
КонецФункции // БитСформироватьТаблицуРеквизитовОбъекта()

// Функция формирует массив объектов системы (доступа).
// 
// Параметры
//  ВидыОбъекта 	   - Массив, "ПеречислениеСсылка.бит_ВидыОбъектовСистемы".
//  МассивИменОбъектов - Массив, массив имен объектов коллекции метаданных,
// 						 не обязательный.
// 
// Возвращаемое значение:
//   СписокОбъектов - СписокЗначений.
// 
Функция ОбъектыСистемыПоВидуИИменам(ВидыОбъекта, МассивИменОбъектов = Неопределено) Экспорт
	
	МассивОбъектов = Новый Массив;
	
	// Заполняем массив объектов доступа.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОбъекта", ВидыОбъекта);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ОбъектыСистемы.Ссылка
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|ГДЕ
	|	бит_ОбъектыСистемы.ВидОбъекта В(&ВидОбъекта)
	|	И (НЕ бит_ОбъектыСистемы.ЭтоГруппа)";
	
	Если МассивИменОбъектов <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("МассивИменОбъектов", МассивИменОбъектов);		
		Запрос.Текст = Запрос.Текст + "
					   |	И бит_ОбъектыСистемы.ИмяОбъекта В(&МассивИменОбъектов)";
	КонецЕсли;
	
	РезультатИзЗапроса = Запрос.Выполнить();	
	Если Не РезультатИзЗапроса.Пустой() Тогда
		
		ВыборкаИзЗапроса = РезультатИзЗапроса.Выбрать();		
		Пока ВыборкаИзЗапроса.Следующий() Цикл
			МассивОбъектов.Добавить(ВыборкаИзЗапроса.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции // ОбъектыСистемыПоВидуИИменам()

// Функция получает синоним объекта системы (доступа).
// 
// Параметры
//  МетаданныеОбъекта - МетаданныеОбъекта (любого объекта конфигурации), СправочникСсылка.бит_ОбъектыСистемы.
//  ВидФормы          - ПеречислениеСсылка.бит_ВидыФормОбъекта, по умолчанию "Списка", не обязателен.
// 
// Возвращаемое значение:
//   СинонимОбъекта - Строка.
// 
Функция ПолучитьСинонимОбъектаСистемы(МетаданныеОбъекта, ВидФормы = Неопределено) Экспорт
	
	СтруктураСвойств = Новый Структура("Заголовок");
	
	// Проверим доступность механизм управленческого учета в данной версии.
	Если бит_ОбщегоНазначения.ЕстьМеханизмУправленческогоУчета() Тогда
		
		Если ВидФормы = Неопределено Тогда
			ВидФормы = Перечисления.бит_ВидыФормОбъекта.Списка;
		КонецЕсли;
		
		// Получим синоним объекта для вида формы.
		бит_НазначениеСинонимовОбъектов.ВывестиЗаголовокФормы(МетаданныеОбъекта, СтруктураСвойств, ВидФормы);
		
	КонецЕсли;
	
	// Если установлен синоним в регистре сведений "бит_СинонимыОбъектов", тогда.
	Если ЗначениеЗаполнено(СтруктураСвойств.Заголовок) Тогда
		
		СинонимОбъекта = СтруктураСвойств.Заголовок;
		
	Иначе
		// Иначе берем наименование или синоним.
		
		// Если передана ссылка на объект доступа, тогда.
		Если ТипЗнч(МетаданныеОбъекта) = Тип("СправочникСсылка.бит_ОбъектыСистемы") Тогда
			СинонимОбъекта = МетаданныеОбъекта.Наименование;
		Иначе
			СинонимОбъекта = МетаданныеОбъекта.Синоним;
		КонецЕсли;

	КонецЕсли;
	
	Возврат СинонимОбъекта;
	
КонецФункции // ПолучитьСинонимОбъектаСистемы()

// Функция получает представление объекта системы из списка значений.
// 
// Параметры:
//  СписокОбъектов - СписокЗначений.
//  ОбъектДоступа  - СправочникСсылка.бит_ОбъектыСистемы.
// 
// Возвращаемое значение:
//  Строка.
// 
Функция ПолучитьПредставлениеОбъектаСистемыИзСпискаЗначений(СписокОбъектов, ОбъектДоступа) Экспорт
	
	ПредставлениеОбъекта = "";
	
	Если Не ТипЗнч(СписокОбъектов) = Тип("СписокЗначений")
		Или СписокОбъектов.Количество() = 0 Тогда
		Возврат ПредставлениеОбъекта;
	КонецЕсли;
	
	ЗаписьСОбъектом = СписокОбъектов.НайтиПоЗначению(ОбъектДоступа);
	
	Если ЗаписьСОбъектом <> Неопределено Тогда
		ПредставлениеОбъекта = ЗаписьСОбъектом.Представление;
	КонецЕсли;
	
	Возврат ПредставлениеОбъекта;
	
КонецФункции // ПолучитьПредставлениеОбъектаСистемыИзСпискаЗначений()

// Функция формирует список значений объектов системы с установленными
// синонимами для выбора.
// 
// Параметры
//  МассивОбъектов - МетаданныеОбъекта (любого объекта конфигурации), СправочникСсылка.бит_ОбъектыСистемы.
//  ВидФормы       - ПеречислениеСсылка.бит_ВидыФормОбъекта, по умолчанию "Списка", не обязателен.
// 
// Возвращаемое значение:
//   СписокЗначений.
// 	
Функция ОбъектыСистемыДляВыбора(МассивОбъектов, ВидФормы = Неопределено) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
    Для Каждого ТекОбъект Из МассивОбъектов Цикл
		
		// Получим синоним объекта.
		СинонимОбъекта = ПолучитьСинонимОбъектаСистемы(ТекОбъект, ВидФормы);
		
		// Получаем картинку объекта по виду объекта.
	    КартинкаОбъекта = бит_УправлениеОбъектамиСистемы.ОпределитьКартинкуВидаОбъекта(ТекОбъект.ВидОбъекта);
		
        // Добавим объект в список выбора объектов.
        СписокВыбора.Добавить(ТекОбъект, СинонимОбъекта,, КартинкаОбъекта);
        
    КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции // ОбъектыСистемыДляВыбора()

// Процедура обрабатывает событие "ПередОткрытием" в формах элемента/документа. 
// Проверяется право на создание редактирование.
// 
// Параметры:
//  Отказ        - Булево.
//  Элемент      - ЭлементУправления.
//  ТекущаяФорма - Форма.
//  ДопПараметры - Структура.
//                
Процедура ПередОткрытиемФормы(Отказ,СтандартнаяОбработка, ТекущийОбъект, ТекущаяФорма, ДопПараметры = Неопределено) Экспорт
	
	// Если копирование запрещено - форму не открываем.
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("Отказ") Тогда
		
		Если ТекущийОбъект.ДополнительныеСвойства.Отказ Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
		
	КонецЕсли;
	
	События = ПроверитьПраваДоступа(ТекущийОбъект, Пользователи.ТекущийПользователь());
	
	// Если создание запрещено - форму не открываем.
	Если События.Свойство("Создание") Тогда
		ОповеститьОбОтсутствииДоступа(ТекущийОбъект,События,Отказ);			
	КонецЕсли; 
	
	// Если редактирование запрещено устанавливаем на форму ТолькоПросмотр.
	Если События.Свойство("Редактирование") Тогда		
		ТекущаяФорма.ТолькоПросмотр = НЕ События.Редактирование;		
	КонецЕсли; 
	
КонецПроцедуры // ПередОткрытиемФормы()	

// Процедура обрабатывает событие "ПередОткрытием" в формах отчета/обработки. Проверяется право на доступ к объекту.
// 
// Параметры:
//  Отказ        - Булево.
//  Элемент      - ЭлементУправления.
//  ТекущаяФорма - Форма.
//  ДопПараметры - Структура.
//                
Процедура ПередОткрытиемФормыОтчета(Отказ,СтандартнаяОбработка,ТекущийОбъект,ТекущаяФорма,ДопПараметры=Неопределено) Экспорт
	
	События = ПроверитьПраваДоступа(ТекущийОбъект, Пользователи.ТекущийПользователь());
	ОповеститьОбОтсутствииДоступа(ТекущийОбъект,События,Отказ);			
	
КонецПроцедуры // ПередОткрытиемФормыОтчета()

// Функция получает значение права пользователя.
// 
// Параметры:
//  Пользователь  - СправочникСсылка.Пользователь, 
// 					 СправочникСсылка.ГруппаПользователей.
//  Право		   - ПланВидовХарактеристикСсылка.бит_ДополнительныеПраваПользователей. 
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ПолучитьЗначениеДопПраваПользователя(Пользователь, Право) Экспорт
 
 	Разрешено = Ложь;
	
 	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Право"		, Право);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Группы.Ссылка КАК Группа
	|ПОМЕСТИТЬ ГруппыПользователя
	|ИЗ
	|	Справочник.ГруппыПользователей.%ИмяТабЧасти% КАК Группы
	|ГДЕ
	|	Группы.Пользователь = &Пользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(НастройкиПрав.Значение), ЛОЖЬ) КАК Значение
	|ИЗ
	|	РегистрСведений.бит_НастройкиДополнительныхПравПользователей КАК НастройкиПрав
	|ГДЕ
	|	(НастройкиПрав.Пользователь = &Пользователь
	|			ИЛИ НастройкиПрав.Пользователь В
	|				(ВЫБРАТЬ
	|					ГруппыПользователя.Группа
	|				ИЗ
	|					ГруппыПользователя))
	|	И НастройкиПрав.Право = &Право
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ГруппыПользователя";	
				   
    ИмяТабЧасти  = бит_ОбщегоНазначения.ИмяТабЧастиГруппыПользователей();
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяТабЧасти%", ИмяТабЧасти);	

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Если Не Результат.Пустой() Тогда
        
        Выборка.Следующий();
        Разрешено = Выборка.Значение;

    КонецЕсли; 

    Возврат Разрешено;
 	
КонецФункции // ПолучитьЗначениеДопПраваПользователя()

// Процедура проверяет соответствие профилей доступа у пользователя и заместителя.
//
// Параметры:
//  Заместитель.
//  Пользователь.
//
Процедура ПроверкаПрофилейДоступаПользователяИЗаместителя(Заместитель, Пользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Профили.Ссылка КАК Профиль
		|ИЗ
		|	Справочник.ПрофилиГруппДоступа КАК Профили
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|		ПО Профили.Ссылка = ГруппыДоступа.Профиль
		|			И (НЕ(ГруппыДоступа.Пользователь <> &Пользователь
		|					И НЕ Профили.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПрофилиГруппДоступа.Администратор))))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ПО (ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка)
		|			И (ГруппыДоступаПользователи.Пользователь = &Пользователь)
		|ГДЕ
		|	НЕ Профили.ПометкаУдаления
		|	И НЕ ГруппыДоступаПользователи.Ссылка ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Профили.Ссылка КАК Профиль
		|ИЗ
		|	Справочник.ПрофилиГруппДоступа КАК Профили
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|		ПО Профили.Ссылка = ГруппыДоступа.Профиль
		|			И (НЕ(ГруппыДоступа.Пользователь <> &Заместитель
		|					И НЕ Профили.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПрофилиГруппДоступа.Администратор))))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ПО (ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка)
		|			И (ГруппыДоступаПользователи.Пользователь = &Заместитель)
		|ГДЕ
		|	НЕ Профили.ПометкаУдаления
		|	И НЕ ГруппыДоступаПользователи.Ссылка ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Заместитель" , Заместитель);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаПрофилейПользователь = РезультатЗапроса[0].Выгрузить();
	ТаблицаПрофилейЗаместитель  = РезультатЗапроса[1].Выгрузить();

	ЕстьРасхождение = Ложь;
	Для Каждого Профиль Из ТаблицаПрофилейПользователь Цикл
		НайденнаяСтрока =  ТаблицаПрофилейЗаместитель.Найти(Профиль, "Профиль");
		Если НайденнаяСтрока = Неопределено Тогда
			ЕстьРасхождение = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьРасхождение Тогда
		ТекстСообщения = НСтр("ru='У назначенного заместителя ""%1"" не совпадают назначенные профили групп доступа с пользователем ""%2"". 
		                          |Возможна не корректная работа механизма прав доступа на уровне записей, обратитесь к администратору.';
		      				  |en='The designated alternate ""% 1 "" does not match the assigned access group profiles with the user ""%2"". 
		                          |Possible incorrect operation of the access rights mechanism at the record level, contact the administrator.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Заместитель, Пользователь);																					   
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);	
	КонецЕсли;

КонецПроцедуры // ПроверкаПрофилейДоступаПользователяИЗаместителя()	

// Процедура копирует настройки РЛС пользователя заместителю 
//
// Параметры:
//  Заместитель.
//  Пользователь.
//
Процедура ОбработатьНастройкиРЛСПользователя(Пользователь, Заместитель) Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыПользователейСостав.Ссылка КАК ГруппаПользователей
		|ПОМЕСТИТЬ ГруппыПользователя
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|ГДЕ
		|	ГруппыПользователейСостав.Пользователь = &Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_рлс_ПраваДоступа.ВидНастройки,
		|	бит_рлс_ПраваДоступа.ВидОбластиДоступа,
		|	бит_рлс_ПраваДоступа.Пользователь,
		|	бит_рлс_ПраваДоступа.Разделитель_1,
		|	бит_рлс_ПраваДоступа.Разделитель_2,
		|	бит_рлс_ПраваДоступа.Разделитель_3,
		|	бит_рлс_ПраваДоступа.Разделитель_4,
		|	бит_рлс_ПраваДоступа.Чтение,
		|	бит_рлс_ПраваДоступа.Запись,
		|	бит_рлс_ПраваДоступа.ВидНаследования,
		|	бит_рлс_ПраваДоступа.Замещение,
		|	бит_рлс_ПраваДоступа.ПользовательЗамещение
		|ИЗ
		|	РегистрСведений.бит_рлс_ПраваДоступа КАК бит_рлс_ПраваДоступа
		|ГДЕ
		|	(бит_рлс_ПраваДоступа.Пользователь = &Пользователь
		|			ИЛИ бит_рлс_ПраваДоступа.Пользователь В
		|				(ВЫБРАТЬ
		|					ГруппыПользователя.ГруппаПользователей
		|				ИЗ
		|					ГруппыПользователя))";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		РегистрСведений = РегистрыСведений.бит_рлс_ПраваДоступа.СоздатьНаборЗаписей();
		РегистрСведений.Отбор.ВидНастройки.Установить(Выборка.ВидНастройки);
		РегистрСведений.Отбор.ВидОбластиДоступа.Установить(Выборка.ВидОбластиДоступа);
		РегистрСведений.Отбор.Пользователь.Установить(Заместитель);
		РегистрСведений.Отбор.Разделитель_1.Установить(Выборка.Разделитель_1);
		РегистрСведений.Отбор.Разделитель_2.Установить(Выборка.Разделитель_2);
		РегистрСведений.Отбор.Разделитель_3.Установить(Выборка.Разделитель_3);
		РегистрСведений.Отбор.Разделитель_4.Установить(Выборка.Разделитель_4);
        РегистрСведений.Отбор.Замещение.Установить(Ложь);

		РегистрСведений.Прочитать();
		
		Если РегистрСведений.Количество() = 0 Тогда
			
			// добавление новой записи
		    НоваяЗапись = РегистрыСведений.бит_рлс_ПраваДоступа.СоздатьМенеджерЗаписи();
		    НоваяЗапись.ВидНастройки  = Выборка.ВидНастройки;
		    НоваяЗапись.ВидОбластиДоступа = Выборка.ВидОбластиДоступа;
		    НоваяЗапись.Пользователь  = Заместитель;
			НоваяЗапись.Разделитель_1 = Выборка.Разделитель_1;
		    НоваяЗапись.Разделитель_2 = Выборка.Разделитель_2;
		    НоваяЗапись.Разделитель_3 = Выборка.Разделитель_3;
            НоваяЗапись.Разделитель_4 = Выборка.Разделитель_4;
			НоваяЗапись.Чтение        = Выборка.Чтение;
		    НоваяЗапись.Запись        = Выборка.Запись;
            НоваяЗапись.Замещение     = Истина;
			НоваяЗапись.ПользовательЗамещение = Пользователь;
			
			Попытка		
				НоваяЗапись.Записать();				
				ТекстСообщения = НСтр("ru='Установлен заместитель ""%1"" пользователю ""%2"" по правам доступа (RLS).';
									  |en='Established deputy ""%1"" user ""%2"" on access rights (RLS).'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Заместитель, Пользователь);
				
			Исключение				
				ТекстСообщения = НСтр("ru='Не удалось установить заместителя ""%1"" пользователю ""%2"" по правам доступа (RLS). Описание ошибки: ""%3"".';
									  |en='Unable to establish deputy ""%1"" user ""%2"" on access rights (RLS). Error description: ""%3"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Заместитель, Пользователь, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));																							 
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);	 
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбработатьНастройкиРЛСПользователя()

// Процедура удаляет настройки РЛС заместителя по окончании замещения. 
//
// Параметры:
//  Заместитель.
//  Пользователь.
//
Процедура УдалитьПраваРЛСЗаместителя(Пользователь, Заместитель) Экспорт
	
	Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Возврат;
	КонецЕсли;
	
	РегистрСведенийНазначенныеЗаместители = РегистрыСведений.бит_НазначенныеЗаместители.СоздатьНаборЗаписей();
	РегистрСведенийНазначенныеЗаместители.Отбор.Пользователь.Установить(Пользователь);
	РегистрСведенийНазначенныеЗаместители.Отбор.Заместитель.Установить(Заместитель);
	РегистрСведенийНазначенныеЗаместители.Отбор.Состояние.Установить(Перечисления.бит_СостоянияЗаместителей.Назначен);
	
	РегистрСведенийНазначенныеЗаместители.Прочитать();
	
	Если РегистрСведенийНазначенныеЗаместители.Количество() = 0 Тогда

		РегистрСведенийПрава = РегистрыСведений.бит_рлс_ПраваДоступа.СоздатьНаборЗаписей();
		РегистрСведенийПрава.Отбор.Пользователь.Установить(Заместитель);
		РегистрСведенийПрава.Отбор.ПользовательЗамещение.Установить(Пользователь);
		РегистрСведенийПрава.Отбор.Замещение.Установить(Истина);

		РегистрСведенийПрава.Прочитать();
		РегистрСведенийПрава.Очистить();
		
		Попытка
			
			РегистрСведенийПрава.Записать();
			
			ТекстСообщения = НСтр("ru='Удален заместитель ""%1"" пользователя ""%2"" по правам доступа (RLS).';
								  |en='Deputy Removed ""%1"" user ""%2"" on access rights (RLS).'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Заместитель, Пользователь);
			
		Исключение
					
			ТекстСообщения = НСтр("ru='Не удалось удалить заместителя ""%1"" пользователя ""%2"" по правам доступа (RLS). Описание ошибки: ""%3"".';
								  |en='Unable to remove the deputy ""%1"" user ""%2"" on access rights (RLS). Error description: ""%3"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Заместитель, Пользователь, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
																						 
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);																	 
						
		КонецПопытки;

	КонецЕсли;
	
КонецПроцедуры

// Процедура оповещает пользователя об отсутствии доступа.
// 
// Параметры:
//  ТекущийОбъект - СправочникСсылка,ДокументСсылка.
//  События       - Структура - ключ: строка- имя события, значение: булево - доступность события.
//  Отказ         - Булево.
// 
Процедура ОповеститьОбОтсутствииДоступа(ТекущийОбъект,События,Отказ)
	 
    МетаданныеОбъекта = ТекущийОбъект.Метаданные();
    ВидОбъекта        = ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);
    
    Если ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Обработка 
     ИЛИ ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.Отчет Тогда

        Если События.Свойство("Редактирование") Тогда
            События.Вставить("Доступ", События.Редактирование);
            События.Удалить("Редактирование");
        КонецЕсли; 
    КонецЕсли; 

    Для каждого КлючИЗначение Из События Цикл
		
		Если ТипЗнч(КлючИЗначение.Значение) <> Тип("Булево") Тогда
            Продолжить;
        КонецЕсли; 

        Если НЕ КлючИЗначение.Значение Тогда
            
            ТекстСообщения = НСтр("ru='Отсутствует право ""%1"" над объектом ""%2"".'; 
								  |en='There is no ""%1"" right over the ""%2"" object.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, КлючИЗначение.Ключ, МетаданныеОбъекта.Синоним);
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru='Области доступа:';en='Access areas:'") + Символы.ПС;
			
			Ошибки = Новый Массив;
			Если События.Свойство("ОбластиДоступа") Тогда
				Для каждого Элемент Из События.ОбластиДоступа Цикл
					Ошибки.Добавить(Строка(Элемент));
                КонецЦикла; 
            КонецЕсли; 
			
			ТекстСообщения = ТекстСообщения + СтрСоединить(Ошибки, ",");			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
			ИмяСобытия = НСтр("ru='Доступ.Отказ в доступе';en='Access.Denial of access'", ОбщегоНазначения.КодОсновногоЯзыка());
        	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, МетаданныеОбъекта,, ТекстСообщения);
			
        КонецЕсли; 
    КонецЦикла; 
	 
КонецПроцедуры // ОповеститьОбОтсутствииДоступа()

// Функция вызывает форму выбора объектов системы для выбора
// и обрабатывает выбор объекта.
//
// Параметры:
//  СписокОбъектов       - СписокЗначений.
//  ТекущийОбъект        - СправочникСсылка.бит_ОбъектыСистемы.
//  ИмяОбъектаСистемы    - Строка, не обязательный.
//  ПредставлениеОбъекта - Строка, не обязательный.
//
//  Отказ 				 - Булево, признак отказа открытия формы, не обязательный.
//  Заголовок			 - Строка, заголовок окна выбора объектов системы,
//						   не обязательный.
//
// Возвращаемое значение:
//  ОбъектВыбран - Булево.
//
Функция ВыбратьОбъектСистемыИзСпискаЗначений(СписокОбъектов, ТекущийОбъект, ИмяОбъектаСистемы = "",
								  			 ПредставлениеОбъекта = "", Отказ = Ложь, Заголовок = "") Экспорт
	
	ОбъектВыбран = Ложь;
	
	Заголовок = ?(Заголовок = "", "Выбор объекта: Регистр бухгалтерии", Заголовок);
	
	ВыбЭлемент = СписокОбъектов.НайтиПоЗначению(ТекущийОбъект);
	ВыбЭлемент = СписокОбъектов.ВыбратьЭлемент(Заголовок, ВыбЭлемент);
	
	Если ВыбЭлемент = Неопределено Тогда
		
		Отказ = Истина;
	
	ИначеЕсли Не ВыбЭлемент.Значение = ТекущийОбъект Тогда
		
		ТекущийОбъект 	     = ВыбЭлемент.Значение;
		ИмяОбъектаСистемы 	 = ТекущийОбъект.ИмяОбъекта;
		ПредставлениеОбъекта = ВыбЭлемент.Представление;
		
		ОбъектВыбран = Истина;
		
	КонецЕсли;
	
	Возврат ОбъектВыбран;
	
КонецФункции // ВыбратьОбъектСистемыИзСпискаЗначений()

#КонецОбласти

#КонецОбласти
